Autodesk.Revit.DB.ElementType.Duplicate(System.String)
Duplicates an existing element type and assigns it a new name.
name:
The new name of the element type.
Returns:
The duplicated element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
-or-
The element type name was empty, contained invalid characters, or was invalid for the specific element type.
-or-
The name is already in use for this element type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL